<a href="https://colab.research.google.com/github/NatashaKamami/Python-Data-Analysis/blob/main/Deleting_Wine.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Wine

### Introduction:

This exercise is a adaptation from the UCI Wine dataset.
The only pupose is to practice deleting data with pandas.

### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data).

### Step 3. Assign it to a variable called wine

In [ ]:
wine = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data',header=None)

### Step 4. Delete the first, fourth, seventh, nineth, eleventh, thirteenth and fourteenth columns

In [ ]:
columns_to_delete = [0, 3, 6, 8, 10, 12, 13]
wine.drop(wine.columns[columns_to_delete], axis=1, inplace=True)

### Step 5. Assign the columns as below:

The attributes are (donated by Riccardo Leardi, riclea '@' anchem.unige.it):  
1) alcohol  
2) malic_acid  
3) alcalinity_of_ash  
4) magnesium  
5) flavanoids  
6) proanthocyanins  
7) hue

In [ ]:
wine.columns = ['alcohol', 'malic_acid', 'alcalinity_of_ash', 'magnesium', 'flavanoids', 'proanthocyanins', 'hue']
wine.columns

Index(['alcohol', 'malic_acid', 'alcalinity_of_ash', 'magnesium', 'flavanoids',
       'proanthocyanins', 'hue'],
      dtype='object')

### Step 6. Set the values of the first 3 rows from alcohol as NaN

In [ ]:
wine.loc[:2, 'alcohol'] = np.nan
wine.loc[:2, 'alcohol']

0   NaN
1   NaN
2   NaN
Name: alcohol, dtype: float64

### Step 7. Now set the value of the rows 3 and 4 of magnesium as NaN

In [ ]:
wine.loc[3:4, 'magnesium'] = np.nan
wine.loc[3:4, 'magnesium']

3   NaN
4   NaN
Name: magnesium, dtype: float64

### Step 8. Fill the value of NaN with the number 10 in alcohol and 100 in magnesium

In [ ]:
wine['alcohol'].fillna(10, inplace=True)
print(wine.loc[:2, 'alcohol'])
wine['magnesium'].fillna(100, inplace=True)
print(wine.loc[3:4, 'magnesium'])

0    10.0
1    10.0
2    10.0
Name: alcohol, dtype: float64
3    100.0
4    100.0
Name: magnesium, dtype: float64

<ipython-input-8-00695163125a>:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  wine['alcohol'].fillna(10, inplace=True)
<ipython-input-8-00695163125a>:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  wine['magnesium'].fillna(100, inplace=True)

### Step 9. Count the number of missing values

In [ ]:
wine.isna().sum()

alcohol              0
malic_acid           0
alcalinity_of_ash    0
magnesium            0
flavanoids           0
proanthocyanins      0
hue                  0
dtype: int64

### Step 10.  Create an array of 10 random numbers up until 10

In [ ]:
random_indices = np.random.randint(0, 10, 10)
random_indices

array([4, 1, 4, 9, 9, 4, 5, 2, 0, 1])

### Step 11.  Use random numbers you generated as an index and assign NaN value to each of cell.

In [ ]:
for index in random_indices:
    wine.loc[index] = np.nan

### Step 12.  How many missing values do we have?

In [ ]:
wine.isna().sum().sum()

42

### Step 13. Delete the rows that contain missing values

In [ ]:
wine.dropna(inplace=True)

### Step 14. Print only the non-null values in alcohol

In [ ]:
wine['alcohol'].dropna()

3      14.37
6      14.39
7      14.06
8      14.83
10     14.10
       ...
173    13.71
174    13.40
175    13.27
176    13.17
177    14.13
Name: alcohol, Length: 172, dtype: float64

### Step 15.  Reset the index, so it starts with 0 again

In [ ]:
wine.reset_index(drop=True, inplace=True)

### BONUS: Create your own question and answer it.

In [ ]:
# Example: Find the mean of each column after cleaning
wine.mean()

alcohol              12.978023
malic_acid            2.350698
alcalinity_of_ash    19.607558
magnesium            99.331395
flavanoids            1.993721
proanthocyanins       1.576512
hue                   0.954686
dtype: float64